# Data Cleaning

In [1]:
import pandas as pd

In [2]:
dataset = "geo005"

In [3]:
root_path = "/Users/dmarcous/myCode/thesis/data/" + dataset + "/"
input_path = root_path + "raw/"
output_path = root_path + "clean/"

In [4]:
input_name = input_path + "raw.csv"
input_df = pd.read_csv(input_name)
input_df['id'] = input_df.reset_index().index

/Users/dmarcous/anaconda3/lib/python3.6/site-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (9,10,11,12,13) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [5]:
selected_df = input_df[['id','longitude','latitude']]
print(selected_df.shape)

(11061987, 3)

In [6]:
clean_df = selected_df.dropna().sample(frac=0.05, random_state=666)
print(clean_df.shape)
clean_df.head(n=20)

(553099, 3)

                id  longitude  latitude
8902448    8902448  -85.53161  31.81516
2011622    2011622  109.46311  28.24008
10824270  10824270  105.72802  19.15680
5022226    5022226  129.05928  36.67962
3379634    3379634  123.61306  -1.60639
989639      989639  -64.53944  50.54389
1475615    1475615  120.39844  32.73281
926316      926316  -98.68355  52.33441
9025670    9025670  -82.93263  30.33828
5539569    5539569   98.96071  12.82264
8042482    8042482   57.35740  56.87860
9903924    9903924 -106.64419  35.14588
2827676    2827676   22.59296  63.67414
6551984    6551984    6.17729  62.66506
10781283  10781283  105.30000  19.31667
8690182    8690182   10.39389  35.93056
2030323    2030323  106.51900  34.44570
6070537    6070537  111.81667   1.76667
2310794    2310794   15.08759  49.70960
7223954    7223954  -74.89296 -12.66757

In [7]:
clean_df.tail(n=10)

              id  longitude  latitude
7387677  7387677   68.75833  25.98472
7251329  7251329  152.18333  -4.31667
2429339  2429339   11.50000  48.18333
3604445  3604445  119.03890  -9.49900
4081802  4081802   82.85939  21.99480
2729981  2729981   -6.59105  43.49833
749117    749117  -54.08333 -23.71667
2545205  2545205  -70.02793  19.03492
9360500  9360500  -80.11144  36.66708
6153649  6153649   40.25000 -14.16667

In [8]:
clean_df.shape

(553099, 3)

In [9]:
clean_df['longitude'].dropna().shape

(553099,)

In [10]:
print(clean_df['longitude'].max())
print(clean_df['longitude'].min())
print(clean_df['latitude'].max())
print(clean_df['latitude'].min())

180.0
-179.96667
90.0
-90.0

In [11]:
clean_df['latitude'].dropna().shape

(553099,)

## Main

In [12]:
output_name = output_path + "output.csv"
clean_df.to_csv(output_name, index=False, header=False)